Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/employment/enforcement_and_redress/enforcing_your_employment_rights.html.txt.tmx
Source language: en
Languages: ga

source: Overview of employment rights enforcement
ga: Cur i bhfeidhm do chearta fostaíochta

source: People working have certain rights under employment law such as a minimum wage and annual leave
ga: Faoin dlí fostaíochta tá cearta áirithe ag daoine ag obair ar nós íosráta pá agus saoire bhliantúil

source: If you are not getting your rights or entitlements or if you lose your job and consider your dismissal was unfair, there are various organisations which can assist you to enforce your rights – see 'How to apply' below
ga: Mura bhfuil do chearta nó teidlíochtaí á dtabhairt duit nó má chailleann tú do phost nó má cheapann tú gur dífhostaíodh tú go héagórach, tá eagraíochtaí éagsúla ann le cabhrú leat chun do chearta a chur i bhfeidhm – féach ‘Conas iarratas a dhéanamh’ thíos

source: Since 1 October 2015, the main organisations involved in employment rights enforcement are the Workplace Relations Commission and the Labour Court
ga: Ón 1 Deireadh Fómhair 2015, is iad na príomheagraíochtaí a bhfuil baint acu le cearta fostaíochta a chur i bhfeidhm ná an Coimisiún um Chaidreamh san Áit Oibre agus an Chúirt Oibreachais

source: Reform of employment rights structures
ga: Athchóiriú na struchtúr um chearta fostaíochta

source: The Workplace Relations Act 2015 came into effect on 1 October 2015
ga: Tháinig an tAcht um Chaidreamh san Áit Oibre 2015 i bhfeidhm an 1 Meán Fómhair 2015

source: It reorganised and reformed the existing employment rights structures as follows:
ga: Rinne sé athchóiriú ar na struchtúir um chearta fostaíochta a bhí ann cheana mar seo a leanas:

source: • The Workplace Relations Commission (WRC) replaced the Labour Relations Commission, Rights Commissioner Service, Equality Tribunal, and National Employment Rights Authority
ga: • Tháinig an Coimisiún um Chaidreamh san Áit Oibre (WRC) in ionad an Choimisiúin um Chaidreamh Oibreachais, na Seirbhíse Choimisinéir um Chearta, an Bhinse Comhionannais agus an Údaráis Náisiúnta um Chearta Fostaíochta

source: It is now the body of first instance, that is, where all complaints are first made
ga: Tá sé anois mar chomhlacht céadchéime, sin é, ina ndéantar gearáin ar dtús

source: All hearings are now heard by a single adjudicator
ga: Éisteann breithneoir aonair gach éisteacht anois

source: • The Labour Court now deals with all workplace relations appeals, including those formerly heard by the Employment Appeals Tribunal
ga: • Déileálann an Chúirt Oibreachais le gach achomharc san ionad oibre, lena n-áirítear na hachomhairc a éisteadh ag an mBinse Achomhairc Fhostaíochta roimhe seo

source: • The time limits for lodging complaints and appeals have been standardised
ga: • Rinneadh caighdeánú ar na teorainneacha ama ina gcaitear gearáin agus achomhairc a dhéanamh

source: • Reasoned, written decisions of all adjudications will now be published
ga: • Foilseofar cinntí réasúnaithe i scríbhinn de gach breithiúnas

source: • There are new mechanisms to encourage employment law compliance and to deal with non-compliance
ga: • Tá meicníochtaí nua ann chun comhlíonadh dlí fostaíochta a spreagadh agus déileáil le neamh-chomhlíonadh

source: • A WRC Information and Customer Service has been set up to encourage the resolution of disputes in the workplace
ga: • Tá Seirbhísí Custaiméara agus Faisnéise WRC socruithe suas chun réiteach conspóidí san ionad oibre a spreagadh

source: • An Early Resolution Service aims to facilitate resolution of disputes without the need to resort to a hearing or inspection
ga: • Tá sé mar aidhm ag Seirbhís Luath-Réitigh chun conspóidí a réiteach gan ghá d’éisteacht nó d’iniúchadh

source: The Workplace Relations Commission’s main function is to promote the improvement of workplace relations
ga: Is é príomhchuspóir an Choimisiúin um Chaidreamh san Áit Oibre feabhsú i gcaidrimh san ionad oibre a chur chun cinn

source: It is the body to which all workplace relations disputes and all disputes and complaints about employment laws are presented
ga: Is é an comhlacht é faoina gcuirtear gach díospóid faoi chaidreamh san ionad oibre agus gach díospóid agus gearán faoi dhlíthe fostaíochta i láthair

source: It resolves disputes by providing a range of services to employers, employees and trade unions
ga: Réitíonn sé conspóidí trí réimse leathan seirbhísí a sholáthar d'fhostóirí, d'fhostaithe agus do cheardchumainn

source: They include inspection of employment rights compliance and the provision of information, mediation, conciliation, advisory and adjudication services
ga: Áirítear iniúchadh comhlíonta cearta fostaíochta agus soláthar seirbhísí faisnéise, idirghabhála, idir-réitigh, comhairleach agus breithnithe

source: The WRC now deals with disputes about equality and discrimination
ga: Déileálann an WRC anois le díospóidí maidir le comhionannas agus idirdhealú

source: It has published the Guide to Employment, Labour and Equality Law (pdf)
ga: D’fhoilsigh sé Treoir do Dhlí Fostaíochta, Saothair agus Comhionannais (pdf)

source: The Labour Court may investigate industrial disputes in certain circumstances
ga: Féadann an Chúirt Oibreachais fiosrúchán a dhéanamh ar aighneas tionsclaíoch i gcásanna áirithe

source: It also deals with all workplace relations appeals, so you may appeal to it against decisions of an adjudicator
ga: Chomh maith le sin, déileálann sé le gach achomharc san ionad oibre agus féadann tú achomharc i gcoinne cinntí bhreithneora a dhéanamh

source: The Employment Appeals Tribunal continues to hear appeals submitted before the commencement of the Workplace Relations Act on 1 October 2015
ga: Leanann an Binse Achomhairc Fhostaíochta éist achomhairc curtha isteach roimh thús an Achta um Chaidreamh san Áit Oibre ar an 1 Meán Fómhair 2015

source: You make a complaint enforcing one of your employment rights under the relevant employment law
ga: Déanann tú gearán ag forfheidhmiú ceann de do chearta fostaíochta faoin dlí fostaíochta iomchuí

source: For example, your annual leave entitlement is set out under the Organisation of Working Time Act 1997
ga: Mar shampla tá do theidlíocht maidir le saoire bhliantúil leagtha amach faoin Acht um Eagrú Ama Oibre 1997

source: You must use the online complaint form available on workplacerelations.ie
ga: Caithfidh tú an fhoirm ghearáin ar líne ar workplacerelations.ie a úsáid

source: You can read this list of frequently asked questions about making a complaint
ga: Léigh an liosta de cheisteanna coitianta maidir le gearán a dhéanamh

source: If you need information about employment law and your employment rights you can contact Workplace Relations Commission's Information and Customer Service
ga: Más mian leat tuilleadh faisnéise a fháil faoi dlí agus chearta fostaíochta, déan teagmháil leis an tSeirbhís Faisnéise agus Custaiméara an Choimisiúin um Chaidreamh san Áit Oibre

source: Some employment legislation prohibits employers from victimising or penalising employees who try to enforce or are enforcing their employment rights
ga: Cuireann roinnt reachtaíocht fostaíochta cosc ar fhostóirí ó íospairt a dhéanamh ar fhostaithe nó pionóis a ghearradh orthu sin a dhéanann iarracht a gcuid ceart a fhorfheidhmiú nó atá ag forfheidhmiú a gcuid cheart

source: Examples of victimisation are less favourable treatment than other employees, or dismissal
ga: Samplaí de Íospairt is ea cóir níos lú fabhar ná fostaithe eile, nó dífhostú

source: Compensation payments and tax
ga: Íocaíochtaí cúitimh agus cáin

source: If you are awarded a compensation payment as a result of an employment rights claim, in certain cases the payment may be exempt from income tax under Section 7 of the Finance Act 2004
ga: Má bhronntar íocaíocht chúitimh ort mar thoradh ar éileamh ar chearta fostaíochta, i roinnt cásanna, féadfaidh an íocaíocht bheith díolmhaithe ó cháin ioncaim faoi Alt 7 den Acht Airgeadais 2004

source: The exemption applies to payments arising out of recommendations or decisions by a relevant authority following a formal hearing or mediation
ga: Baineann an díolúine le híocaíochtaí a eascraíonn as moltaí nó cinntí a rinne údarás ábhartha i ndiaidh éisteacht fhoirmiúil nó idirghabhála

source: You can read more details about this in Revenue’s leaflet, Exemption from Income Tax – IT 71
ga: Féadfaidh tú breis sonraí a léamh faoi seo i mbileog na gCoimisinéirí Ioncaim, Díolúine ó Cháin Ioncaim – IT 71
